[
    {
        "id": 1,
        "title": "1. Orientacja i nawigacja",
        "description": "Użytkownicy mogą łatwo poruszać się po systemie, przeszukiwać jego zawartość i w każdym momencie określać, gdzie się znajdują.",
        "checkpoints": [
            "Czy podczas nawigacji za pomocą klawiatury oznaczenie punktów interaktywnych jest zawsze widoczne i wyraźne?",
            "Czy istnieje więcej niż jeden sposób dotarcia do zawartości stron (menu, wyszukiwanie, mapa strony)?",
            "Czy na każdej stronie istnieją  linki pomijające lub linki szybkiego dostępu do ważnych obszarów treści na stronie?",
            "Czy strony mają sensowne tytuły z tematem strony na początku?",
            "Czy nagłówki głównej zawartości stron są takie same lub podobne jak tytuł stron?",
            "Czy wszystkie istotne sekcje na stronach  mają nagłówki opisujące zwięźle i jasno cel lub przeznaczenie sekcji?",
            "Czy cele odnośników są zrozumiałe z nich samych lub z poprzedzającego je bezpośrednio kontekstu?",
            "Czy na każdej stronie wskazane jest miejsce aktualnej strony lub sekwencji kroków w strukturze serwisu?"
        ]
    },
    {
        "id": 2,
        "title": "2. Struktura i semantyka",
        "description": "Użytkownicy mogą zrozumieć strukturę treści na każdej stronie i zrozumieć, jak działać w systemie.",
        "checkpoints": [
            "Czy zawartość strony jest podzielona na istotne obszary opisane sensownymi nagłówkami lub etykietami?",
            "Czy struktura i organizacja stron jest przejrzysta, logiczna i zrozumiała?",
            "Czy cała podstawowa zawartość stron znajduje się w głównym obszarze strony?",
            "Czy hierarchia struktury nagłówków jest poprawna i nie pomija żadnego poziomu?",
            "Czy treści, które wyglądają jak nagłówki, są zdefiniowane jako nagłówki?",
            "Czy bloki tekstu są prezentowane za pomocą odpowiednich elementów HTML – akapitów, list, tabel, bloków cytatów?",
            "Czy dane w tabelach są wyraźnie przypisane do nagłówków kolumn i/lub wierszy?"
        ]
    },
    {
        "id": 3,
        "title": "3. Kontrast i czytelność",
        "description": "Tekst i inne istotne informacje mogą być bez trudu rozróżniane i odczytywane przez użytkowników.",
        "checkpoints": [
            "Czy współczynnik kontrastu tekstu do tła wynosi co najmniej 4,5:1 (3:1 dla dużego tekstu)?",
            "Czy współczynnik kontrastu pierwszego planu do tła znaczącej grafiki wynosi co najmniej 3:1?",
            "Czy rozstaw wierszy w blokach tekstu wynosi co najmniej 150% rozmiaru czcionki  i 200% między akapitami?",
            "Czy wybrane kroje pisma są łatwe do odczytania i czy są prawidłowo prezentowane na telefonie komórkowym?",
            "Czy powiększenie rozmiaru tekstu lub ekranu do 200% nie powoduje problemów z czytelnością?",
            "Czy wyróżnienia w tekście stosowane są oszczędnie i pomagają w skanowaniu zawartości?",
            "Czy instrukcje odwołujące się do zmysłów są przekazywane również w inny sposób?"
        ]
    },
    {
        "id": 4,
        "title": "4. Język i zrozumiałość",
        "description": "Zawartość strony może być łatwo odczytana i zrozumiała dla użytkowników.",
        "checkpoints": [
            "Czy w kodzie określony jest naturalny język strony?",
            "Czy w kodzie jest określony język innojęzycznych fragmentów stron?",
            "Czy treść jest dzielona na małe porcje informacji (sekcje, akapity, listy) ułatwiające czytanie i zrozumienie?",
            "Czy tytuły stron, tytuły części stron oraz śródtytuły sekcji zawartości są opisowe, zwięzłe i unikalne?",
            "Czy legendy i etykiety w formularzach są sformułowane w sposób zrozumiały dla użytkowników?",
            "Czy język zawartości jest prosty i łatwy w czytaniu?",
            "Czy skróty i nietypowe słowa są objaśniane?"
        ]
    },
    {
        "id": 5,
        "title": "5. Zapobieganie i stany błędów",
        "description": "Kontrolki formularzy mają sensowne etykiety lub instrukcje, które pomagają zapobiegać błędom i zapewniają użytkownikom jasne komunikaty o błędach, wskazując, na czym błąd polega i jak go naprawić, gdy się pojawi.",
        "checkpoints": [
            "Czy pola formularzy opisane są zrozumiałymi etykietami?",
            "Czy etykiety i instrukcje są wyświetlane w bezpośredniej bliskości powiązanych pól formularzy?",
            "Czy etykiety i instrukcje wypełniania pól są widoczne i czy są odczytywane przez czytnik ekranu?",
            "Czy pola wymagane są oznaczone jako takie w tekstach etykiet lub w inny zauważalny sposób?",
            "Czy przed wysłaniem formularza z ważnymi danymi użytkownik może sprawdzić i potwierdzić ich poprawność?",
            "Czy błędy są sygnalizowane i opisywane natychmiast po wystąpieniu w bezpośrednim sąsiedztwie pola z błędem?",
            "Czy system przekazuje sugestie dotyczące naprawy wykrytych błędów?"
        ]
    },
    {
        "id": 6,
        "title": "6. Przewidywalność i spójność",
        "description": "Działanie każdego elementu jest przewidywalne, stałe elementy powtarzają się na stronach w tym samym porządku, a sposób, w jaki każdy element wpływa na system jako całość, jest jasny i zrozumiały.",
        "checkpoints": [
            "Czy podczas nawigacji fokus przemieszcza się w spodziewanej i logicznej kolejności zgodnej ze znaczeniem treści?",
            "Czy użytkownicy są informowani, że przeniesienie fokusa na pole formularza spowoduje zmianę kontekstu?",
            "Czy użytkownicy są informowani, że wprowadzenie danych w polu formularza spowoduje zmianę kontekstu?",
            "Czy powtarzające się na stronach bloki treści znajdują się w tych samych pobocznych obszarach strony?",
            "Czy powtarzające się funkcje są na wszystkich stronach oznaczane w taki sam sposób?",
            "Czy oznaczanie nagłówkami powtarzających się treści pobocznych jest konsekwentne?",
            "Czy kolejność pozycji w menu i paskach nawigacyjnych jest taka sama?"
        ]
    },
    {
        "id": 7,
        "title": "7. Alternatywy treści wizualnych i dźwiękowych",
        "description": "Treści czysto wizualne lub dźwiękowe, które przekazują informacje, mają odpowiedniki tekstowe dla użytkowników, którzy nie widzą albo nie słyszą.",
        "checkpoints": [
            "Czy obrazy przekazujące informacje lub funkcje są opatrzone tekstami alternatywnymi opisującymi ich treść lub cel?",
            "Czy obrazy złożone posiadają tekst alternatywny i rozszerzony pełny opis tekstowy?",
            "Czy grafiki dekoracyjne są osadzane za pomocą CSS lub opisane pustym atrybutem alt?",
            "Czy do  wcześniej nagranych multimediów są dołączone napisy dla niesłyszących, transkrypcje lub audiodeskrypcje?",
            "Czy napisy dla niesłyszących i audiodeskrypcje są poprawnie zsynchronizowane?",
            "Czy napisy dla niesłyszących, transkrypcje i  audiodeskrypcje są odpowiednie?",
            "Czy dołączono specjalną informację w języku migowym dla osób głuchych?"
        ]
    },
    {
        "id": 8,
        "title": "8. Metody i warunki interakcji",
        "description": "Użytkownicy mogą się skutecznie komunikować z systemem za pomocą wybranego przez siebie sposobu wprowadzania danych (np. mysz, klawiatura, dotyk, polecenia głosowe, itp.) na wybranym urządzeniu.",
        "checkpoints": [
            "Czy projekt można skutecznie bez specjalnych zabiegów przeglądać lub odsłuchać na różnych urządzeniach?",
            "Czy projekt dostosowuje się elastycznie do różnych rozmiarów i orientacji wyświetlaczy?",
            "Czy każdą interakcję można w pełni obsłużyć tylko za pomocą klawiatury?",
            "Czy każdą interakcję można w pełni obsłużyć za pomocą ekranu dotykowego?",
            "Czy każdą interakcję można w pełni obsłużyć za pomocą poleceń głosowych?",
            "Czy liczba punktów interaktywnych jest ograniczona (np. poprzez łączenie sąsiadujących linków)?",
            "Czy obszary interaktywne są wielkości co najmniej 44x44 piksele?"
        ]
    },
    {
        "id": 9,
        "title": "9. Czas i ochrona danych",
        "description": "Użytkownicy mają wystarczająco dużo czasu na wykonanie swoich zadań i nie tracą informacji, jeśli czas (np. sesja) się kończy.",
        "checkpoints": [
            "Czy użytkownikom udostępniono mechanizm ubiegania się z wyprzedzeniem o przedłużenie czasu?",
            "Czy nadchodzące limity czasu sesji są wyraźnie oznaczone jako takie w projekcie?",
            "Czy użytkownicy mogą wyłączać, dostosowywać lub przedłużać limity czasowe, gdy sesje się kończą?",
            "Czy projekt oferuje opcje odroczenia lub zablokowania przerw w pracy?",
            "Czy użytkownik może żądać aktualizacji treści, zamiast aktualizacji automatycznej?",
            "Czy istnieje mechanizm umożliwiający odzyskiwanie danych po ponownym uwierzytelnieniu użytkownika?",
            "Czy użytkownik może zapisać dane w wypełnianym formularzu, by korzystać z nich po ponownym uwierzytelnieniu?"
        ]
    },
    {
        "id": 10,
        "title": "10. Poruszanie i migotanie",
        "description": "Elementy na stronie, które poruszają się, migają lub przesuwają w inny sposób, mogą zostać zatrzymane i nie rozpraszają ani nie przeszkadzają użytkownikom.",
        "checkpoints": [
            "Czy użytkownik może wstrzymać, zatrzymać lub ukryć  odtwarzanie animacji, nagrań filmowych i dźwiękowych?",
            "Czy pliki wideo i audio nie są ustawione na automatyczne odtwarzanie?",
            "Czy automatyczna aktualizacja treści może być w pełni kontrolowana przez użytkowników?",
            "Czy użytkownik może kontrolować szybkość, z jaką treści są aktualizowana automatycznie?",
            "Czy poziom głośności dźwięku można regulować za pomocą widocznego elementu sterującego?",
            "Czy efekty migania, mrugania lub poruszania, jeśli występują, są wolniejsze niż 3 razy na sekundę?",
            "Czy zawartość reklamowa jest prezentowana dyskretnie i nie zakłóca korzystania ze strony?"
        ]
    }
]